EZ32Inc/esp32jtag_firmware/main/main.c
#include "sdkconfig.h"

#include <unistd.h>

#include "esp_log.h"
#include "esp_system.h"
#include "esp_mac.h"
#include "esp_event.h"
#include "esp_netif.h"
#include "nvs_flash.h"
#include "esp_check.h"
#include "driver/uart.h"
#include "esp_timer.h"
#include "driver/ledc.h"
#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_http_client.h"
#include "esp_http_server.h"
#include "freertos/semphr.h"
#include "esp_wifi.h"
#include "driver/gpio.h"

#include "types.h"
#include "storage.h"
#include "network.h"
#include "descriptors.h"
#include "network_mngr.h"
#include "network_mngr_ota.h"
#include "web_server.h"
#include "uart_websocket.h"
#include "ui.h"
#include "../components/lcd/lcd_library.h"
#include "GUI_Paint.h"
#include "gdb_main.h"
#include "port_cfg.h"
#include "xvc_server.h"
#include "esp32jtag_common.h"
#include "ice.h"
#include "dap_main.h"
#include "usb_config.h"
#include "chry_ringbuffer.h"

#include <stdio.h>
#include <stdarg.h>

//in ../components/CherryDAP/dap_main.c
int usb_cdc_log_vprintf(const char *format, va_list args);
#define usb_log_vprintf usb_cdc_log_vprintf

extern void uartx_preinit(void);
extern void uart_event_task(void *pvParameters);

static void cherry_dap_task(void *arg) {
    if (g_app_params.uart_port_sel == 0) {
        uartx_preinit();
    }
    while (1) {
        chry_dap_handle();
        if (g_app_params.uart_port_sel == 0) {
            uart_event_task(NULL);
            chry_dap_usb2uart_handle();
        }
        // ESP_LOGI("DAP", "cherry_dap_task");
        vTaskDelay(1); // Optional yield if needed, but handle might be blocking or polling
    }
}

//assign {SWD_GPIO, LA_input_sel, cfgpd, cfgpb, cfgpa, njtag_swdio, sreset} = data_reg_0[6:0];  //from nvme1t/work/esp32jtag_v1d3_ice4kup/top.v

uint8_t global_data_reg_0 = 0; //for port configuration and sreset, njtag_swdio
uint8_t global_data_reg_1 = 0; //bit 7 to set wr_and_rd or read only, bit 6 to 0 to set PC and PD output enable and signal types

extern void platform_init(void); //from ./components/blackmagic_esp32
extern void logic_analyzer_init();

//global:
SemaphoreHandle_t capture_start_semaphore;
SemaphoreHandle_t capture_done_semaphore;
bool gbl_capture_started = false;
bool gbl_triggered_flag = true;
bool gbl_all_captured_flag = true;
uint32_t gbl_wr_addr_stop_position = 0;
uint32_t gbl_trigger_position = 0;

uint8_t *gbl_spi_rxbuf = NULL;

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
#include "driver/uart_vfs.h"
#define vfs_dev_port_set_rx_line_endings uart_vfs_dev_port_set_rx_line_endings
#define vfs_dev_port_set_tx_line_endings uart_vfs_dev_port_set_tx_line_endings
#define vfs_dev_uart_use_driver uart_vfs_dev_use_driver
#else
#include "esp_vfs_dev.h"
#define vfs_dev_port_set_rx_line_endings esp_vfs_dev_uart_port_set_rx_line_endings
#define vfs_dev_port_set_tx_line_endings esp_vfs_dev_uart_port_set_tx_line_endings
#define vfs_dev_uart_use_driver esp_vfs_dev_uart_use_driver
#endif

static const char *TAG = "MAIN";

//configurations for each ESP32JTAG 4 ports
uint8_t gbl_pa_cfg = 0;
uint8_t gbl_pb_cfg = 0;
uint8_t gbl_pc_cfg = 0;
uint8_t gbl_pd_cfg = 0;

app_params_t g_app_params;

adc_oneshot_unit_handle_t gbl_adc_handle = NULL;
adc_cali_handle_t adc1_cali_chan0_handle = NULL;

//components/blackmagic_esp32/src/platforms/esp32/main/gdb_if.c:void set_gdb_socket(int socket) 

extern void set_gdb_socket(int socket);
extern void set_gdb_listen(int socket);
unsigned short gbl_gdb_port = 4242; //same as stlink st-util GDB

extern volatile bool config_received;

spi_device_handle_t gbl_spi_h1 = NULL;

esp_err_t gpio_out_init(gpio_num_t gpio_num, uint32_t init_level)
{
    // 1. Configure the GPIO pin
    gpio_config_t io_conf = {};
    // Disable interrupt
    io_conf.intr_type = GPIO_INTR_DISABLE;
    // Set as output mode
    io_conf.mode = GPIO_MODE_OUTPUT;
    // Bit mask for the pins (only gpio_num)
    io_conf.pin_bit_mask = (1ULL << gpio_num);
    // Disable pull-down mode
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    // Disable pull-up mode
    io_conf.pull_up_en = GPIO_PULLUP_DISABLE;

    // Configure the GPIO with the settings
    gpio_config(&io_conf);
    
    // 2. Set the GPIO state to HIGH (3.3V)
    esp_err_t err = gpio_set_level(gpio_num, init_level);
    
    if (err == ESP_OK) {
        // Log success
        ESP_LOGI("GPIO_INIT", "GPIO %d initialized and set to %d successfully.", gpio_num, init_level);
    } else {
        // Log error if setting failed
        ESP_LOGE("GPIO_INIT", "Failed to init and set GPIO. Error code: %d", gpio_num, err);
    }
    return err;
    
}

static void init_gpio_sw1_sw2(void)
{
    ESP_LOGI(TAG, "Init GPIO0 and GPIO48 as input"); //, PIN_PUSHBUTTON_BOOT_SW1, PIN_PUSHBUTTON_SW2);
    gpio_config_t io_conf = {
        .mode = GPIO_MODE_INPUT,
        .pin_bit_mask = (1ULL << PIN_PUSHBUTTON_BOOT_SW1) | (1ULL << PIN_PUSHBUTTON_SW2) ,
        .pull_down_en = 0,
        .pull_up_en = 0,
        .intr_type = GPIO_INTR_DISABLE
    };
    gpio_config(&io_conf);
}

static esp_err_t load_fpga(void)
{
    extern const unsigned char bitstream_bin_start[] asm("_binary_bitstream_bin_start");
    extern const unsigned char bitstream_bin_end[]   asm("_binary_bitstream_bin_end");
    const size_t sz = (bitstream_bin_end - bitstream_bin_start);

    ESP_LOGI(TAG, "Configuring FPGA, bin file size=%ld", sz);

    uint8_t cfg_stat;
    int8_t retry = 3;
    while ((cfg_stat = ICE_FPGA_Config(bitstream_bin_start, sz)) && (--retry)) {
        ESP_LOGW(TAG, "FPGA configured ERROR - status = %d retry=%d", cfg_stat, retry);
    }
    if (retry)
        ESP_LOGI(TAG, "FPGA configured OK - status = %d retry=%d", cfg_stat, retry);
    else
        ESP_LOGW(TAG, "FPGA configured ERROR - giving up");

    return ESP_OK;
}

#define SPI_MAX_TRANSFER_BYTES  4096
#define SPI_CLK_MHZ             (20*1000*1000)
#define INITIAL_VIO_DUTY        8   /* 8/1024 → ~3.30V output */

static spi_device_handle_t spi_device_1_manual_handle;
static spi_device_handle_t spi_device_2_hw_handle;
static spi_device_handle_t spi_device_3_hw_handle;
static spi_device_handle_t spi_device_4_hw_handle;
esp_err_t spi_master_init(void){
    ESP_LOGI(TAG, "Doing spi_master_init()");


    // 1. Bus configuration (same for all devices on this bus)
    spi_bus_config_t buscfg = {
        .mosi_io_num = PIN_NUM_MOSI,
        .miso_io_num = PIN_NUM_MISO,
        .sclk_io_num = PIN_NUM_CLK,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = SPI_MAX_TRANSFER_BYTES
    };

    // Initialize the bus
    //esp_err_t ret = spi_bus_initialize(SPI_HOST_USED, &buscfg, SPI_DMA_CH_AUTO);
    esp_err_t ret = spi_bus_initialize(XVC_SPI_HOST, &buscfg, SPI_DMA_CH_AUTO);
    //esp_err_t ret = spi_bus_initialize(XVC_SPI_HOST, &buscfg, SPI_DMA_DISABLED);
    if (ret != ESP_OK){
        return ret;
    }

    // 2. Device 1 configuration with manual CS control
    spi_device_interface_config_t devcfg_1_manual = {
        //.clock_speed_hz = SPI_CLK_MHZ,
#if USING_ARTIX7_BOARD
        .clock_speed_hz = 26*1000*1000, //
#else
        .clock_speed_hz = 40*1000*1000, //
#endif
        .mode = 0,
        .spics_io_num = -1, // Use -1 for manual control
        //.spics_io_num = PIN_NUM_CS0, // Let the driver control this CS pin
        .queue_size = 7,
    };

    // Add Device 1 to the bus, getting its unique handle
    //ret = spi_bus_add_device(XVC_SPI_HOST, &devcfg_1_manual, &spi_device_1_manual_handle);
    ret = spi_bus_add_device(SPI_HOST_USED, &devcfg_1_manual, &spi_device_1_manual_handle);//using SPI_HOST_USED!!! Same as LCD
    if (ret != ESP_OK){
        ESP_LOGE(TAG, "spi_bus_add_device devcfg_1_manual failed");
        return ret;
    }
    gbl_spi_h1 = spi_device_1_manual_handle; //spi device for LA capture

    // 3. Device 2 configuration with hardware CS control
    spi_device_interface_config_t devcfg_2_hw = {
        .clock_speed_hz = SPI_CLK_MHZ,
        .mode = 0,
        .spics_io_num = PIN_NUM_CS1, // Let the driver control this CS pin
        .queue_size = 7,
    };

