EZ32Inc/esp32jtag_firmware/main/main.c
    // Add Device 2 to the bus, getting its unique handle
    ret = spi_bus_add_device(XVC_SPI_HOST, &devcfg_2_hw, &spi_device_2_hw_handle);
    if (ret != ESP_OK){
        ESP_LOGE(TAG, "spi_bus_add_device devcfg_2_hw failed");
        return ret;
    }

    // 4. Device 3 configuration with hardware CS control
    spi_device_interface_config_t devcfg_3_hw = {
        .clock_speed_hz = SPI_CLK_MHZ,
        .mode = 0,
        .spics_io_num = PIN_NUM_CS2, // Let the driver control this CS pin
        .queue_size = 7,
    };

    // Add Device 3 to the bus, getting its unique handle
    ret = spi_bus_add_device(XVC_SPI_HOST, &devcfg_3_hw, &spi_device_3_hw_handle);
    if (ret != ESP_OK){
        ESP_LOGE(TAG, "spi_bus_add_device devcfg_3_hw failed");
        return ret;
    }
    ESP_LOGI(TAG, "spi_bus_add_device devcfg_3_hw OK!");

    // 5. Device 4 configuration with hardware CS control
    spi_device_interface_config_t devcfg_4_hw = {
        .clock_speed_hz = SPI_CLK_MHZ,
        .mode = 0,
        .spics_io_num = PIN_NUM_CS3, // Let the driver control this CS pin
        .queue_size = 7,
    };

    // Add Device 4 to the bus, getting its unique handle
    ret = spi_bus_add_device(XVC_SPI_HOST, &devcfg_4_hw, &spi_device_4_hw_handle);
    if (ret != ESP_OK){
        ESP_LOGE(TAG, "spi_bus_add_device devcfg_4_hw failed");
        return ret;
    }
    ESP_LOGI(TAG, "spi_bus_add_device devcfg_4_hw OK!");

    // 6. Manually configure the CS pin for Device 1 as a GPIO output
    gpio_config_t io_conf = {};
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_OUTPUT;
    io_conf.pin_bit_mask = (1ULL << PIN_NUM_CS0);
    io_conf.pull_down_en = 0;
    io_conf.pull_up_en = 0;
    gpio_config(&io_conf);
    gpio_set_level(PIN_NUM_CS0, 1); //Assert CS by default

    ESP_LOGI(TAG, "spi_master_init() done, gbl_spi_h1 is %s.", gbl_spi_h1==NULL? "NULL":"Not NULL"); 
    return ret;
}
esp_err_t spi_comm_with_device_0(const uint8_t *tx_data, uint8_t *rx_data, size_t length)
{
    spi_transaction_t t = {
        .length = length * 8,          // length in **bits**
        .tx_buffer = tx_data,
        .rx_buffer = rx_data,
    };

    gpio_set_level(PIN_NUM_CS0, 0); // Manual CS assert
    esp_err_t ret = spi_device_transmit(spi_device_1_manual_handle, &t);
    gpio_set_level(PIN_NUM_CS0, 1); // Manual CS de-assert
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "SPI transfer failed: %s", esp_err_to_name(ret));
    } else {
        //ESP_LOGI(TAG, "Transfer successful. len=%d",length);
    }
    return  ret;
}

// Define a type for the SPI device handle for clarity
typedef spi_device_handle_t spi_handle_t;

/**
 * @brief Transfers data over SPI for a specified device.
 *
 * @param device_handle The handle of the SPI device to use (e.g., spi_device_2_hw_handle).
 * @param tx_data Pointer to the transmit buffer.
 * @param rx_data Pointer to the receive buffer (or NULL if not needed).
 * @param length The length of the data in bytes.
 * @return esp_err_t ESP_OK on success, or an error code on failure.
 */
esp_err_t spi_transfer_data(spi_handle_t device_handle, const uint8_t *tx_data, uint8_t *rx_data, size_t length)
{
    // 1. Prepare the SPI transaction structure
    spi_transaction_t t = {
        // 'length' is in bytes, but the SPI function expects length in **bits**
        .length = length * 8,
        .tx_buffer = tx_data,
        .rx_buffer = rx_data,
    };

    // 2. Transmit the data using the specified device handle
    esp_err_t ret = spi_device_transmit(device_handle, &t);

    // 3. Check for errors and log if necessary
    if (ret != ESP_OK) {
        // Use a generic error log, as the device is now dynamic
        ESP_LOGE(TAG, "SPI transfer failed: %s", esp_err_to_name(ret));
    }
    // You can keep the successful transfer log commented out or remove it
    /* else {
        //ESP_LOGI(TAG, "Transfer successful. len=%d", length);
    } */

    return ret;
}

// Helper wrappers for compatibility and cleaner usage in other parts of the code
esp_err_t spi_device2_transfer_data(const uint8_t *tx_data, uint8_t *rx_data, size_t length)
{
    return spi_transfer_data(spi_device_2_hw_handle, tx_data, rx_data, length);
}

esp_err_t spi_device3_transfer_data(const uint8_t *tx_data, uint8_t *rx_data, size_t length)
{
    return spi_transfer_data(spi_device_3_hw_handle, tx_data, rx_data, length);
}

esp_err_t spi_device4_transfer_data(const uint8_t *tx_data, uint8_t *rx_data, size_t length)
{
    return spi_transfer_data(spi_device_4_hw_handle, tx_data, rx_data, length);
}
void set_gpio_high_z(gpio_num_t gpio_num)
{
    // Configure as input
    gpio_config_t io_conf = {
        .pin_bit_mask = 1ULL << gpio_num,
        .mode = GPIO_MODE_INPUT,      // Input mode = high-impedance
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE
    };
    gpio_config(&io_conf);
}

extern void gdb_application_thread(void *pvParameters);


/* Read a uint8 from NVS by key. On miss, writes default and uses it. */
static void load_nvs_uint8(const char *key, uint8_t *out, uint8_t default_val)
{
    char *val = NULL;
    if (storage_alloc_and_read(key, &val) == ESP_OK && val) {
        *out = (uint8_t)atoi(val);
        free(val);
    } else {
        *out = default_val;
        char buf[4];
        snprintf(buf, sizeof(buf), "%d", default_val);
        storage_write(key, buf, strlen(buf) + 1);
        ESP_LOGI(TAG, "Saved default %s=%d to NVS", key, default_val);
    }
}

static void load_port_configurations(void)
{
    load_nvs_uint8(PORT_A_CFG_KEY, &gbl_pa_cfg, PA_LOGICANALYZER);
    load_nvs_uint8(PORT_B_CFG_KEY, &gbl_pb_cfg, PB_LOGICANALYZER);
    load_nvs_uint8(PORT_C_CFG_KEY, &gbl_pc_cfg, PC_LOGICANALYZER);
    load_nvs_uint8(PORT_D_CFG_KEY, &gbl_pd_cfg, PD_LOGICANALYZER);

    // uart_port_sel is 'char', handled separately
    char *val = NULL;
    if (storage_alloc_and_read(UART_PORT_SEL_KEY, &val) == ESP_OK && val) {
        g_app_params.uart_port_sel = (uint8_t)atoi(val);
        free(val);
    } else {
        g_app_params.uart_port_sel = 0;
        storage_write(UART_PORT_SEL_KEY, "0", 2);
        ESP_LOGI(TAG, "Saved default UART_PORT_SEL=0 to NVS");
    }

