EZ32Inc/esp32jtag_firmware/main/main.c
        for (int i = 0; i < sta_list.num; i++) {
            wifi_sta_info_t sta = sta_list.sta[i];
            ESP_LOGI(TAG, "STA %d: MAC=%02X:%02X:%02X:%02X:%02X:%02X, RSSI=%d dBm",
                     i + 1,
                     sta.mac[0], sta.mac[1], sta.mac[2],
                     sta.mac[3], sta.mac[4], sta.mac[5],
                     sta.rssi);
        }
    } else {
        ESP_LOGE(TAG, "Failed to get STA list: %s", esp_err_to_name(ret));
    }
}
esp_err_t set_cfga(bool use_porta, bool use_portb, bool use_portc, bool use_portd, bool njtag_swdio, bool swd_gpio){
    esp_err_t ret1 = 0;
    uint8_t tx[3]={0x0,0,0};
    uint8_t rx[3]={0};
    tx[0] = global_data_reg_1 | 0x80;

    global_data_reg_0 &= ~(CFGPA | CFGPB | CFGPC | CFGPD);

    if(use_porta) {
        global_data_reg_0 |= CFGPA;
    }
    if(use_portb) {
        global_data_reg_0 |= CFGPB;
    }
    if(use_portc) {
        global_data_reg_0 |= CFGPC;
    }
    if(use_portd) {
        global_data_reg_0 |= CFGPD;
    }

    if(njtag_swdio){
        global_data_reg_0 |= NJTAG_SWDIO;
    }
    else{
        global_data_reg_0 &= ~NJTAG_SWDIO;
    }
    if(swd_gpio){
        global_data_reg_0 |= SWD_GPIO;
    }
    else{
        global_data_reg_0 &= ~SWD_GPIO;
    }

    tx[1] = global_data_reg_0;
    ESP_LOGI(TAG, "set_cfga: global_data_reg_0=0x%02x use_porta/b/c/d=%d %d %d %d, jtag_swdio=%d, swd_gpio=%d", 
            global_data_reg_0, use_porta, use_portb, use_portc, use_portd, njtag_swdio, swd_gpio);

    ret1 = spi_device4_transfer_data(tx, rx, 3);
    ESP_LOGI(TAG, "rx=0x%02x %02x %02x",rx[0],rx[1], rx[2]);
    return ret1;
}
esp_err_t set_la_input_sel(bool use_test_signal)
{
    esp_err_t ret1 = 0;
    uint8_t tx[3]={0x0,0,0};
    uint8_t rx[3]={0};
    tx[0] = global_data_reg_1 | 0x80;
    if(use_test_signal) {
        global_data_reg_0 |= LA_INPUT_SEL;//use internal cnt1 as LA input
    }
    else{
        global_data_reg_0 &= ~LA_INPUT_SEL;
    }
    tx[1] = global_data_reg_0;

    ret1 = spi_device4_transfer_data(tx, rx, 3);
    ESP_LOGI(TAG, "rx=0x%02x %02x %02x",rx[0],rx[1], rx[2]);
    return ret1;
}
bool gbl_sw2_gpio48_flag = false;
void check_sw1_sw2(void)
{
    static uint8_t L0 = 0, L48 = 0;    /* Previous GPIO levels, persist across calls */

    // Read the level of GPIO0
    int level_0 = gpio_get_level(PIN_PUSHBUTTON_BOOT_SW1);

    // Read the level of GPIO48
    int level_48 = gpio_get_level(PIN_PUSHBUTTON_SW2);

    if(L0 != level_0 || L48 != level_48){
        if(L48 != level_48 && level_48 == 1){
            gbl_sw2_gpio48_flag = !gbl_sw2_gpio48_flag;
        }
        ESP_LOGI(TAG, "GPIO%d Level: %d | GPIO%d Level: %d gbl_sw2_gpio48_flag=%s",
                PIN_PUSHBUTTON_BOOT_SW1, level_0,
                PIN_PUSHBUTTON_SW2, level_48,
                gbl_sw2_gpio48_flag ? "True":"False");
        L0 = level_0;
        L48 = level_48;
    }
}

/* Draw initial WiFi mode/SSID info on LCD before network is up. */
static void draw_wifi_startup_info(void)
{
    if (g_app_params.mode == APP_MODE_AP) {
        char ap_ip_buf[16] = {0};
        get_ap_ip_str(ap_ip_buf, sizeof(ap_ip_buf));
        Paint_DrawString_EN(X_OFFSET, 10, "AP Mode", &CURR_FONT, BLACK, BLUE);
        Paint_DrawString_EN(X_OFFSET, 10 + 24 * 2, "SSID:", &CURR_FONT, BLACK, YELLOW);
        Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24 * 2, g_app_params.wifi_ssid, &CURR_FONT, BLACK, MAGENTA);
        Paint_DrawString_EN(X_OFFSET, 10 + 24 * 3, "PSWD:", &CURR_FONT, BLACK, YELLOW);
        Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24 * 3, g_app_params.wifi_pass, &CURR_FONT, BLACK, MAGENTA);
    } else {
        Paint_DrawString_EN(X_OFFSET, 10, "ST Mode", &CURR_FONT, BLACK, BLUE);
        Paint_DrawString_EN(X_OFFSET, 10 + 24 * 2, "SSID:", &CURR_FONT, BLACK, YELLOW);
        Paint_DrawString_EN(X_OFFSET + 17 * 5, 10 + 24 * 2, g_app_params.wifi_ssid, &CURR_FONT, BLACK, MAGENTA);
    }
    // Port row: "PORT XVC:2542 GDB:4242"
    Paint_DrawString_EN(X_OFFSET, 10+24*4, "PORT ", &CURR_FONT, BLACK, YELLOW);
    Paint_DrawString_EN(X_OFFSET + 5*PAINT_CHAR_WIDTH,  10+24*4, "XVC:", &CURR_FONT, BLACK, BLUE);
    Paint_DrawString_EN(X_OFFSET + 9*PAINT_CHAR_WIDTH,  10+24*4, "2542", &CURR_FONT, BLACK, MAGENTA);
    Paint_DrawString_EN(X_OFFSET + 13*PAINT_CHAR_WIDTH, 10+24*4, "GDB:", &CURR_FONT, BLACK, BLUE);
    Paint_DrawString_EN(X_OFFSET + 17*PAINT_CHAR_WIDTH, 10+24*4, "4242", &CURR_FONT, BLACK, MAGENTA);
}

/* Draw PA/PB/PC/PD port configuration on LCD. */
static void draw_port_cfg_info(void)
{
    uint32_t y = 10 + 24*5;
    Paint_DrawString_EN(X_OFFSET, y, "PA:          PB:", &CURR_FONT, BLACK, YELLOW);
    Paint_DrawString_EN(X_OFFSET + 3*PAINT_CHAR_WIDTH, y, "LA", &CURR_FONT, BLACK, MAGENTA);
    Paint_DrawString_EN(X_OFFSET + 16*PAINT_CHAR_WIDTH, y,
        (gbl_pb_cfg == PB_UART_SRESET_VTARGET) ? "UART" : "LA", &CURR_FONT, BLACK, MAGENTA);

    y += 15;
    Paint_DrawString_EN(X_OFFSET, y, "PC:          PD:", &CURR_FONT, BLACK, YELLOW);
    Paint_DrawString_EN(X_OFFSET + 3*PAINT_CHAR_WIDTH, y,
        (gbl_pc_cfg == PC_BMP_SWD_JTAG) ? "SWD/JTAG" : "LA", &CURR_FONT, BLACK, MAGENTA);
    Paint_DrawString_EN(X_OFFSET + 16*PAINT_CHAR_WIDTH, y,
        (gbl_pd_cfg == PD_FPGA_XVC) ? "XVC" : "LA", &CURR_FONT, BLACK, MAGENTA);
}

/* Start background tasks (GDB, logic analyser, XVC). */
static void start_background_tasks(void)
{
    if (gbl_pc_cfg == PC_BMP_SWD_JTAG) {
        ESP_LOGI(TAG, "Creating gdb_thread task. gbl_pa_cfg=%d, gbl_pc_cfg=%d", gbl_pa_cfg, gbl_pc_cfg);
        ESP_LOGI(TAG, "Free heap: %u", esp_get_free_heap_size());
        ESP_LOGI(TAG, "To do platform_init() for BMP");
        platform_init();
        ESP_LOGI(TAG, "To do xTaskCreate(&gdb_application_thread) for BMP");
        BaseType_t result = xTaskCreate(&gdb_application_thread, "gdb_thread", 4096, NULL, 15, NULL);
        if (result != pdPASS) {
            ESP_LOGE(TAG, "Failed to create gdb_thread task! Out of memory?");
        }
    }

    logic_analyzer_init();

    if (gbl_pd_cfg == PD_FPGA_XVC) {
        ESP_LOGI(TAG, "To do xTaskCreate(xvc_server_task)");
        xTaskCreate(xvc_server_task, "xvc_server_task", 4096, NULL, 5, NULL);
    }
}

